"""
Python 3.9 Первая программа на Python - привет, мир!
Название файла 01.hello.py

Version: 0.1
Author: Andrej Marinchenko
Date: 2021-11-02
"""

print('hello, world!')   # просто выводим фразу hello, world! помещенную в кавычки
print('hello', 'world', sep=', ', end='!')  # тоже самое, но по словам и символам середина фразы =', ' конец фразы
# '!' соединил со следующей строкой, для того что бы не было такого необходимо использовать \n
print('следующая строка')
print('goodbye, world', end='!\n')
print('следующая строка')
