# Human-Centered Design for AI
# 1) Сокращение пластиковых отходов
# Камбоджийская организация хочет помочь сократить значительное количество пластиковых отходов, загрязняющих систему
# реки Меконг. Что из следующего было бы подходящим способом начать? (В вашем ответе может быть несколько вариантов
# ответа.)
#
# Наблюдайте за тем, как люди в настоящее время решают проблему, когда они используют существующие инструменты и
# процессы.
# Проведите индивидуальные интервью с людьми, которые в настоящее время занимаются решением проблемы.
# Соберите фокус-группы, состоящие из людей, которые в настоящее время решают проблему.
# После того, как вы ответили на вопрос, просмотрите официальное решение, запустив ячейку кода ниже.


# 2) Обнаружение рака молочной железы
# Патологи пытаются обнаружить рак молочной железы, исследуя клетки на предметных стеклах тканей под микроскопом. Эта
# утомительная и повторяющаяся работа требует экспертного взгляда. Ваша команда хочет создать технологическое
# решение, которое поможет патологоанатомам выполнять эту задачу в режиме реального времени с помощью камеры. Однако
# из-за сложности работы ваша команда не обнаружила, что системы, основанные на правилах, могут повысить ценность
# проверки изображений.

# Да, это было бы. Люди в целом согласны с тем, что цель желательна, тем более что система ИИ будет работать с
# патологоанатомами, а не вместо них. ИИ может помочь людям с повторяющимися задачами, и системы ИИ доказали свою
# эффективность в аналогичных случаях использования распознавания медицинских изображений. Тем не менее,
# важно следовать современным передовым отраслевым практикам и быть тщательным в остальной части процесса
# проектирования, в том числе при анализе вреда и рассмотрении того, как практикующие врачи будут фактически
# взаимодействовать с продуктом в медицинских учреждениях.

# 3) Пометка подозрительной активности
# Банк использует ИИ, чтобы помечать подозрительные международные денежные переводы на предмет возможного отмывания денег, финансирования борьбы с терроризмом или санкций. Хотя система оказалась более эффективной, чем текущие процессы банка, она по-прежнему часто помечает законные транзакции для проверки.
#
# Какой потенциальный вред может причинить система, и как банк может уменьшить последствия этого потенциального вреда?
# Решение: Один из потенциальных недостатков заключается в том, что система ИИ может быть предвзятой по отношению к определенным группам, помечая, задерживая или отклоняя их законные транзакции по более высоким ставкам, чем у других групп. Банк может уменьшить этот вред, тщательно отбирая данные, выявляя и устраняя потенциальную погрешность (см. уроки 3 и 4), не вводя систему в действие до тех пор, пока потенциальная погрешность не будет устранена, и обеспечив надлежащий и непрерывный человеческий надзор за системой после ее запуска.
#

# 4) Прототип чат-бота¶
# Во время продолжающейся вспышки пандемии агентство общественного здравоохранения страны сталкивается с большим количеством телефонных звонков и электронных писем от людей, которые ищут медицинскую информацию. Агентство определило, что интерактивный чат-бот на базе искусственного интеллекта, который отвечает на вопросы, связанные с пандемией, поможет людям быстро получить конкретную информацию, которую они хотят, при этом снизив нагрузку на сотрудников агентства. Как агентству следует начать прототипирование чат-бота?
#
# Разработайте решение ИИ в меру своих возможностей, прежде чем тестировать его с разнообразной группой потенциальных пользователей.
# Быстро создайте прототип без искусственного интеллекта и начните его тестирование с разнообразной группой потенциальных пользователей.
# Решение. Правильный ответ: быстро создать прототип без искусственного интеллекта и начать его тестирование с разнообразной группой потенциальных пользователей. Итерация прототипа без ИИ проще, быстрее и дешевле, чем итерация прототипа ИИ. Итерация прототипа без искусственного интеллекта также предоставляет раннюю информацию об ожиданиях, взаимодействиях и потребностях пользователей. Эта информация должна быть использована при окончательном проектировании прототипов ИИ.
#
# добавить коддобавить уценку
# 5) Обнаружение дезинформации
# Платформа социальных сетей планирует развернуть новую систему искусственного интеллекта для пометки и удаления сообщений социальных сетей, содержащих дезинформацию. Хотя система доказала свою эффективность в тестах, она иногда помечает не вызывающий возражений контент как дезинформацию.
#
# Каким образом платформа социальных сетей может позволить тому, чье сообщение было помечено, оспорить статус дезинформации?
# Решение: Компания, работающая в социальных сетях, должна спросить клиентов, как они хотели бы оспорить решение. Это может быть простой доступ к форме запроса, в которой пользователь может описать, почему его сообщение не содержит дезинформации, запросить дополнительную проверку человеком-рецензентом, запросить объяснение того, почему контент был помечен, или комбинацию этих и других средств.
#
# добавить коддобавить уценку
# 6) Улучшение автономных транспортных средств
# Какие существуют способы повышения безопасности автономных транспортных средств? (Вы можете выбрать более одного варианта.)
#
# Включите функции безопасности обычных транспортных средств.
# Протестируйте систему в различных средах.
# Наймите внутреннюю «красную команду», которая будет играть роль злоумышленников, пытающихся манипулировать системой автономного вождения. Постоянно усиливайте систему против атак команды.
#  Решение: все это отличные способы повысить безопасность.
#


