"""
Общие операции с переменными
Название файла '02.переменные.py'

Version: 0.1
Author: Andrej Marinchenko
Date: 2023-03-04
"""

# вводим данные
a = int(input('Введите значение переменной a = '))
b = int(input('Введите значение переменной b = '))

# выводим данные
print(a + b)  # сумма переменных
print(a - b)  # разность переменных
print(a * b)  # умножение
print(a / b)  # деление
print(a // b)  # деление без остатка
print(a % b)  # разделить по модулю (взятие остатка)
print(a ** b)  # возведение а в степень b
